<?php

namespace Database\Seeders;

use App\Models\AccountTitle;
use Illuminate\Database\Seeder;

class AccountTitleSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $columns = [
            '2130-02' => '台神主日',
            '2130-04' => '玉神主日',
            '2130-05' => '南神主日',
            '2130-07' => '國內外宣道奉獻主日',
            '2130-09' => '大專事工奉獻主日',
            '2130-10' => '客家宣教主日',
            '2130-11' => '總會事工奉獻日',
            '2130-12' => '文字宣道奉獻主日',
            '2130-13' => '教社奉獻主日',
            '2130-14' => '主日學奉獻主日',
            '2130-15' => '普世聖經奉獻主日',
            '2130-16' => '退休傳道者奉獻主日',
            '2130-18' => '原住民傳道者生活補助',
            '2130-19' => '馬槽捐',
            '2130-20' => '西羅亞',
            '2130-22' => '大眾傳播奉獻主日',
            '2130-28' => '盲人事工',
            '2130-29' => '樂山教養院',
            '2130-30' => '特別災害奉獻',
            '2130-31' => '福利園區',
            '2130-32' => '基督精兵協會',
            '2130-33' => '最後晚餐',
            '4103-02' => '月獻',
            '4103-03' => '一般感恩',
            '4103-04' => '新春感恩',
            '4103-05' => '復活節',
            '4103-06' => '聖誕節',
            '4103-07' => '感恩節',
            '4103-08' => '週年紀念主日',
            '4103-09' => '教會事工奉獻主日',
            '4103-10' => '母親節',
            '4103-11' => '盲人事工',
            '4103-12' => '建堂奉獻',
            '4103-14' => '宣教事工',
        ];

        foreach ($columns as $key => $column) {
            $accountTitle = new AccountTitle();
            $accountTitle['account_title_serial_number'] = $key;
            $accountTitle['account_title'] = $column;
            $accountTitle->save();
        }
    }
}
